Тестовая_база_ERP_14/src/InformationRegisters/ОчередьРасчетаПлановыхКалькуляций/ОчередьРасчетаПлановыхКалькуляций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьРасчетаПлановыхКалькуляций</name>
  <attributes>
    <name>ОтменаПроведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Калькуляция</name>
    <type>
      <types>DocumentRef.ПлановаяКалькуляция2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПартияСпецификацияПродукции</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>CatalogRef.РесурсныеСпецификации</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПартияСпецификацияПолуфабриката</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>CatalogRef.РесурсныеСпецификации</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Полуфабрикат</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПолуфабриката</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Разделитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПотребности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/ОчередьРасчетаПлановыхКалькуляций/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Записывает данные в регистр.
//
// Параметры:
//  Очередь	- ТаблицаЗначений - данные для записи.
//  Калькуляция - ДокументСсылка.ПлановаяКалькуляция2_2 - документ, которому принадлежит очередь.
//
Процедура ЗаписатьОчередь(Очередь, Калькуляция) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
	
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьРасчетаПлановыхКалькуляций");
		ЭлементБлокировки.УстановитьЗначение("Калькуляция", Калькуляция);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		Блокировка.Заблокировать();
		
		Разделитель = РазделительОчереди(Калькуляция);
		
		Очередь.Колонки.Добавить("Разделитель");
		Очередь.ЗаполнитьЗначения(Разделитель, "Разделитель");
		
		НаборЗаписей = РегистрыСведений.ОчередьРасчетаПлановыхКалькуляций.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Калькуляция.Установить(Калькуляция);
		НаборЗаписей.Отбор.Разделитель.Установить(Разделитель);
		НаборЗаписей.Загрузить(Очередь);
		
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей.Записать();
		УстановитьПривилегированныйРежим(Ложь);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		НаборЗаписей = РегистрыСведений.ОчередьРасчетаПлановыхКалькуляций.СоздатьНаборЗаписей();
		
		ТекстСообщения = НСтр("ru = 'Не удалось записать очередь расчета плана: %Ссылка% по причине: %Причина%';
								|en = 'Cannot save plan calculation queue: %Ссылка% due to: %Причина%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", Калькуляция);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
			СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			НаборЗаписей.Метаданные(),
			,
			ТекстСообщения);
		
		ВызватьИсключение;
			
	КонецПопытки;
	
КонецПроцедуры

// Очищает данные регистра по заданным измерениям.
//
// Параметры:
//  Очередь	- ТаблицаЗначений - данные измерений для очистки.
//  Калькуляция - ДокументСсылка.ПлановаяКалькуляция2_2 - документ, которому принадлежит очередь.
//
Процедура ОчиститьОчередь(Очередь, Калькуляция) Экспорт
	
	Для каждого Строка Из Очередь Цикл
		
		НаборЗаписей = РегистрыСведений.ОчередьРасчетаПлановыхКалькуляций.СоздатьНаборЗаписей();
		
		Для каждого Колонка Из Очередь.Колонки Цикл
			НаборЗаписей.Отбор[Колонка.Имя].Установить(Строка[Колонка.Имя]);
		КонецЦикла;
		
		Попытка
			УстановитьПривилегированныйРежим(Истина);
			НаборЗаписей.Записать();
			УстановитьПривилегированныйРежим(Ложь);
		Исключение
			
			НаборЗаписей = РегистрыСведений.ОчередьРасчетаПлановыхКалькуляций.СоздатьНаборЗаписей();
			
			ТекстСообщения = НСтр("ru = 'Не удалось очистить очередь расчета плана: %Ссылка% по причине: %Причина%';
									|en = 'Cannot clear plan calculation queue: %Ссылка% : %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", Калькуляция);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
				СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				НаборЗаписей.Метаданные(),
				,
				ТекстСообщения);
			
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#Область Прочее

Функция РазделительОчереди(Калькуляция)
	
	Разделитель = 1;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Калькуляция);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЕСТЬNULL(МАКСИМУМ(Очередь.Разделитель), 0) КАК Разделитель
		|ИЗ
		|	РегистрСведений.ОчередьРасчетаПлановыхКалькуляций КАК Очередь
		|ГДЕ
		|	Очередь.Калькуляция = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Разделитель = ВыборкаДетальныеЗаписи.Разделитель + 1;
	КонецЕсли;
	
	Возврат Разделитель;
	
КонецФункции

Функция СобытиеЖурналаРегистрации()
	
	Возврат НСтр("ru = 'Запись очереди расчета калькуляции продукции';
				|en = 'Write product costing calculation queue'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	
КонецФункции

#КонецОбласти

#КонецЕсли
